let bot = { 'имя': 'Алёна', 'здоровье': 100, 'атака': 40 }

bot['атака'] = 78
// или bot.атака = 78

console.log(bot)

let Kristina = {
    'имя': 'Кристина',
    'возраст': 25,
    'работа': 'Школа программирования EasyCode',
    'предметы': ['Питон', 'Сайты'],
    'образование': {
        'ВУЗ': 'СФ БашГУ',
        'программа': 'прикладная математика и информатика'
    }
}
Kristina['образование']['ВУЗ'] = 'СФ УУНиИТ'
Kristina['образование']['выпуск'] = '2023'


Kristina['предметы'].push('Unity')
Kristina['предметы'].push('Kotlin')
Kristina['предметы'].push('GO')

// Добавить
Kristina['должность'] = 'преподаватель'
console.log(Kristina)

// Удалить
delete Kristina['имя']

// Поменять
Kristina['возраст'] = 26

if (Kristina['возраст'] > 30) {
    console.log('пенсия скоро ура')
}
